{"doi": null, "coreId": "102174696", "oai": "oai:CiteSeerX.psu:10.1.1.603.4820", "magId": null, "identifiers": [], "title": "Published:", "authors": ["Yalçın Tüzün", "Murat Küçüktaş", "Zeynep Meltem Akkurt", "J Turk", "Acad Dermatol"], "enrichments": {"references": [], "citationCount": null, "documentType": {"type": null, "confidence": null}}, "contributors": ["The Pennsylvania State University CiteSeerX Archives"], "datePublished": "2015-07-08", "abstract": "Background: Verrucae are benign proliferations seen in skin and mucosae due to infection with papillomaviruses. They may present differently according to clinical appearance and localization. In time, about 60 % of verrucae spontaneously resolve. Since there is no single effective treatment method, a few different methods may be combined or sequentially applied. Local treatment meth-ods of verrucae will be discussed in this paper. Definition Verrucae are benign proliferations seen in skin and mucosae due to infection with papillomaviruses. These viruses cause slow growing lesions that do not cause acute symptoms or signs [1, 2]. Historical Aspect Verrucae have been known since ancient Greece and Rome. Up until the 19th cen-tury, verrucae were believed to be a form of syphilis or gonorrhea [2]. An infectious eti-ology was first questioned by Payne when he contracted verrucae after treating a pa-tient. Viral etiology was first proposed by Ciuffo in 1907 and Strauss et al. isolated the small DNA virus in 1949. Joseph Mel-nick used the term papovavirus in 1960. The virus was characterized by following re-search and it was named human papilloma virus (HPV) [3]. In 1974, Zur Hausen pro-posed that there may be different types of virus and 4 types were identified in 1976 [4]. Today, due to advanced recombinant DNA technology, over 100 different geno-types of HPV have been identified [2]", "downloadUrl": null, "fullTextIdentifier": "http://www.jotad.org/2009/3/jtad93301r.pdf", "pdfHashValue": null, "publisher": null, "journals": [], "language": null, "relations": [], "year": 2015, "topics": ["Key Words", "verruca", "warts", "topical treatment"], "subjects": ["text"], "fullText": null, "urls": ["http://www.jotad.org/2009/3/jtad93301r.pdf", "http://www.jotad.org/2009/3/jtad93301r.pdf", "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.603.4820"], "issn": null}