{"doi": "10.1371/journal.pone.0011268", "coreId": "161223625", "oai": null, "magId": null, "identifiers": ["10.1371/journal.pone.0011268"], "title": "Involvement of AMPK in Alcohol Dehydrogenase Accentuated Myocardial Dysfunction Following Acute Ethanol Challenge in Mice", "authors": ["Guo Rui", "Scott Glenda I.", "Ren Jun"], "enrichments": {"references": [], "citationCount": null, "documentType": {"type": null, "confidence": null}}, "contributors": [], "datePublished": "2010-06-23", "abstract": " homeostasis, insulin and AMP-dependent kinase (AMPK) signaling. handling and AMPK signaling (including ACC and LKB1) were examined. properties, downregulated protein phosphatase PP2A subunit and PPAR-γ, as well as phosphorylation of AMPK, ACC and LKB1, all of which except plasma insulin were overtly accentuated by ADH transgene. Interestingly, myocardium from ethanol-treated FVB mice displayed enhanced expression of PP2Cα and PGC-1α, decreased insulin receptor expression as well as unchanged expression of Glut4, the response of which was unaffected by ADH. Cardiac AMP-to-ATP ratio was significantly enhanced by ethanol exposure with a more pronounced increase in ADH mice. In addition, the AMPK inhibitor compound C (10 µM) abrogated acute ethanol exposure-elicited cardiomyocyte mechanical dysfunction. mishandling and glucose intolerance, indicating a role of ADH in acute ethanol toxicity-induced cardiac dysfunction possibly related to altered cellular fuel AMPK signaling cascade", "downloadUrl": null, "fullTextIdentifier": "file:///data/core-remote/dit/data/public_library_of_science/pdf/a3d/ZnRwOi8vZnRwLm5jYmkubmxtLm5paC5nb3YvcHViL3BtYy9vYV9wYWNrYWdlLzEwLzEzL1BNQzI4OTA0MTEudGFyLmd6.pdf", "pdfHashValue": null, "publisher": "Public Library of Science", "journals": [], "language": null, "relations": ["http://doi.org/10.1371/journal.pone.0011268"], "year": 2010, "topics": [], "subjects": ["Journal"], "fullText": null, "urls": ["http://doi.org/10.1371/journal.pone.0011268"], "issn": null}