{"doi": null, "coreId": "198088737", "oai": "oai:zir.nsk.hr:zvu_84", "magId": null, "identifiers": [], "title": "Perioperativna zdravstvena njega bolesnika kod transplantacije pluća", "authors": ["Živkušić, Ana"], "enrichments": {"references": [], "citationCount": null, "documentType": {"type": null, "confidence": null}}, "contributors": ["Kovačević, Irena"], "datePublished": "2016-02-17T00:00:00", "abstract": "Transplantacija pluća medicinski je postupak zamjene organa iz tijela žive ili preminule osobe u tijelo primatelja. Koristi se kao krajnji  terapijski postupak u završnoj fazi plućnih bolesti u kojih, uz medikamentoznu terapiju, ne dolazi do poboljšanja ili stabilizacije bolesti. \nU radu će biti prikazana predtransplantacijska priprema, sama transplantacija i posttransplantacijska zdravstvena njega koje zahtijevaju dobru psihičku i fizičku pripremu bolesnika te dobru organizaciju tima u kojoj medicinska sestra ima značajnu ulogu.\nZdravstvena njega u transplantiranih bolesnika predstavlja za medicinsku sestru velik  izazov, zahtijeva od nje veliko znanje, ali i suosjećajnost. Vrlo je važno da je i pacijent uključen u planiranje zdravstvene njege te održava dobru psihičku i fizičku kondiciju i bude samostalan prije, ali i poslije transplantacije pluća", "downloadUrl": null, "fullTextIdentifier": null, "pdfHashValue": null, "publisher": "University of Applied Health Sciences.", "journals": [], "language": null, "relations": [], "year": 2016, "topics": ["BIOMEDICINA I ZDRAVSTVO. Kliničke medicinske znanosti. Sestrinstvo.", "BIOMEDICINE AND HEALTHCARE. Clinical Medical Sciences. Nursing.", "transplantacija pluća", "specifičnosti zdravstvene njege", "postoperativna skrb", "postoperativne komplikacije"], "subjects": ["info:eu-repo/semantics/bachelorThesis", "text"], "fullText": null, "urls": ["https://zir.nsk.hr/islandora/object/zvu:84", "https://zir.nsk.hr/islandora/object/zvu:84/datastream/PDF", "https://urn.nsk.hr/urn:nbn:hr:139:948543"], "issn": null}